In [9]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [10]:
import pandas as pd

In [11]:
##series = it is a one dimensional array type object

In [12]:
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
#create a series from dictionary elements
data = {'a':1,'v':2}
series_dict = pd.Series(data)
print(series_dict)

a    1
v    2
dtype: int64

In [14]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [15]:
##data frame = multidimensional arrays
## create a dataframe from a dictionary of list

data = {
    'Name' : ['krish','john','jack'],
    'age':[12,34,45],
    'town':['bbsr','bam','banglore']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  age      town
0  krish   12      bbsr
1   john   34       bam
2   jack   45  banglore
<class 'pandas.core.frame.DataFrame'>

In [16]:
!pip install numpy
import numpy as np
np.array(df)

Requirement already satisfied: numpy in c:\users\smrut\anaconda3\envs\smrutienv\lib\site-packages (2.3.2)

array([['krish', 12, 'bbsr'],
       ['john', 34, 'bam'],
       ['jack', 45, 'banglore']], dtype=object)

In [17]:
## create a dataframe from a list of dictionaries
data = [
    {'name':'krish','age':32,'city':'banglore'},
    {'name':'radha','age':22,'city':'bulore'},
    {'name':'bheem','age':12,'city':'kanouore'},
]

df = pd.DataFrame(data)
print(df)
print(type(df))

    name  age      city
0  krish   32  banglore
1  radha   22    bulore
2  bheem   12  kanouore
<class 'pandas.core.frame.DataFrame'>

In [58]:
df = pd.read_csv('crop_yield.csv')

In [59]:
df.tail(5)

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
19684,Small millets,1998,Kharif,Nagaland,4000.0,2000,1498.0,395200.00,1160.00,0.500000
19685,Wheat,1998,Rabi,Nagaland,1000.0,3000,1498.0,98800.00,290.00,3.000000
19686,Maize,1997,Kharif,Jammu and Kashmir,310883.0,440900,1356.2,29586735.11,96373.73,1.285000
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818

In [60]:
print(df.head(5))

           Crop  Crop_Year       Season  State     Area  Production  \
0      Arecanut       1997  Whole Year   Assam  73814.0       56708
1     Arhar/Tur       1997  Kharif       Assam   6637.0        4685
2   Castor seed       1997  Kharif       Assam    796.0          22
3      Coconut        1997  Whole Year   Assam  19656.0   126905000
4  Cotton(lint)       1997  Kharif       Assam   1739.0         794

   Annual_Rainfall  Fertilizer  Pesticide        Yield
0           2051.4  7024878.38   22882.34     0.796087
1           2051.4   631643.29    2057.47     0.710435
2           2051.4    75755.32     246.76     0.238333
3           2051.4  1870661.52    6093.36  5238.051739
4           2051.4   165500.63     539.09     0.420909

In [61]:
df.describe()

,Crop_Year,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
count,19689.000000,1.968900e+04,1.968900e+04,19689.000000,1.968900e+04,1.968900e+04,19689.000000
mean,2009.127584,1.799266e+05,1.643594e+07,1437.755177,2.410331e+07,4.884835e+04,79.954009
std,6.498099,7.328287e+05,2.630568e+08,816.909589,9.494600e+07,2.132874e+05,878.306193
min,1997.000000,5.000000e-01,0.000000e+00,301.300000,5.417000e+01,9.000000e-02,0.000000
25%,2004.000000,1.390000e+03,1.393000e+03,940.700000,1.880146e+05,3.567000e+02,0.600000
50%,2010.000000,9.317000e+03,1.380400e+04,1247.600000,1.234957e+06,2.421900e+03,1.030000
75%,2015.000000,7.511200e+04,1.227180e+05,1643.700000,1.000385e+07,2.004170e+04,2.388889
max,2020.000000,5.080810e+07,6.326000e+09,6552.700000,4.835407e+09,1.575051e+07,21105.000000

In [21]:
data

[{'name': 'krish', 'age': 32, 'city': 'banglore'},
 {'name': 'radha', 'age': 22, 'city': 'bulore'},
 {'name': 'bheem', 'age': 12, 'city': 'kanouore'}]

In [22]:
df

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909
...,...,...,...,...,...,...,...,...,...,...
19684,Small millets,1998,Kharif,Nagaland,4000.0,2000,1498.0,395200.00,1160.00,0.500000
19685,Wheat,1998,Rabi,Nagaland,1000.0,3000,1498.0,98800.00,290.00,3.000000
19686,Maize,1997,Kharif,Jammu and Kashmir,310883.0,440900,1356.2,29586735.11,96373.73,1.285000
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818

In [23]:
df = data

In [32]:
data = [
    {'name': 'Krish', 'age': 32, 'city': 'Bangalore'},
    {'name': 'John', 'age': 34, 'city': 'ore'},
    {'name': 'Jack', 'age': 32, 'city': 'Bangae'}
]
df = pd.DataFrame(data)
print(df)

    name  age       city
0  Krish   32  Bangalore
1   John   34        ore
2   Jack   32     Bangae

In [33]:
df['name']

0    Krish
1     John
2     Jack
Name: name, dtype: object

In [34]:
df.iloc[0]

name        Krish
age            32
city    Bangalore
Name: 0, dtype: object

In [35]:
df.loc[0][0]

C:\Users\smrut\AppData\Local\Temp\ipykernel_4324\2552443799.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [36]:
##iloc stands for index location and 
##loc for just location

In [37]:
##accesing a specified elements
df.at[2,'name']

'Jack'

In [38]:
df.iat[2,2]

'Bangae'

In [49]:
#adding a column
df['salary']=[2000,300,4500]
df

    name  age       city  salary
0  Krish   32  Bangalore    2000
1   John   34        ore     300
2   Jack   32     Bangae    4500

In [50]:

df.drop('salary',axis=1)

    name  age       city
0  Krish   32  Bangalore
1   John   34        ore
2   Jack   32     Bangae

In [51]:
df

    name  age       city  salary
0  Krish   32  Bangalore    2000
1   John   34        ore     300
2   Jack   32     Bangae    4500

In [52]:
df.drop('salary',axis = 1,inplace = True)
##to make it permanently delete, we add inplace
df

    name  age       city
0  Krish   32  Bangalore
1   John   34        ore
2   Jack   32     Bangae

In [55]:
## add age to the column
df['age']=df['age']+1
df

    name  age       city
0  Krish   33  Bangalore
1   John   35        ore
2   Jack   33     Bangae

In [57]:
df.drop(0)

   name  age    city
1  John   35     ore
2  Jack   33  Bangae